sea-shell-soap-wiremock/sea-shell-soap-service/src/main/resources/mock/requests/persons/person9.xml

<?xml version="1.0" ?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <ns2:personsRequest xmlns:ns2="http://org.jesperancinha.shells/SeaShellsWSDLPersons/">
            <personId>9</personId>
        </ns2:personsRequest>
    </S:Body>
</S:Envelope>