sea-shell-soap-wiremock/sea-shell-soap-service/src/main/resources/mock/responses/persons/person16.xml

<?xml version="1.0" ?>
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Body>
        <ns2:Person xmlns:ns2="http://org.jesperancinha.shells/SeaShellsWSDLPersons/">
            <Name>Oberyn Martell</Name>
            <Activity>PRINCE_SER</Activity>
            <CostumeId>1</CostumeId>
            <AccountId>AKDMOJOEJHMDF</AccountId>
            <ShellId>1</ShellId>
        </ns2:Person>
    </S:Body>
</S:Envelope>
